[
  {
    "title": "KnowNative (Open-Source Project)",
    "description": "KnowNative is a language learning application focused on enhancing Chinese language skills by improving vocabulary and reading comprehension.",
    "role": "Open Source Core Contributor",
    "accomplishments": [
      "Introduced React’s Context API and useReducer into the app’s codebase as part of the state management refactoring team",
      "Gained experience contributing to a large, unfamilar codebase to create React UI components",
      "Ensured consistency with business requirements and technical specifications during development through code reviews, paired programming sessions, and effective teamwork with the app owner and team of 15+"
    ],
    "tech": ["MongoDB, Express, React, Node"],
    "website": "https://knownative.io/",
    "github": "https://github.com/AbigailDawson/knownative",
    "imgs": [
      [
        "/imgs/project-imgs/knownative-change-difficulty.png",
        "A 'Change Difficulty' feature that I created."
      ],
      [
        "/imgs/project-imgs/knownative-landing.png",
        "Landing Page of the Project."
      ],
      [
        "/imgs/project-imgs/knownative-translate-text.png",
        "Text Translation Feature of the Project."
      ]
    ]
  },
  {
    "title": "WanderWise",
    "description": "WanderWise is a travel advisory application where users can search for recommendations for restaurants, hotels, flights, and recreational activities for their upcoming trips.",
    "role": "Full Stack Software Engineer",
    "accomplishments": [
      "Integrated the Amadeus API, TripAdvisor API, and Google Places API to deliver personalized travel suggestions for users",
      "Designed responsive interfaces for desktop and mobile devices and oversaw web accessibility efforts for greater user experience",
      "Implemented Next.js for full-stack development under a 2-week deadline, working with both AWS Amplify and Vercel for deployment"
    ],
    "tech": [
      "Next.js (App Router)",
      "React",
      "Supabase",
      "PostgreSQL",
      "NextAuth.js",
      "Tailwind CSS"
    ],
    "website": "https://wanderwise-project.vercel.app/",
    "github": "https://github.com/psantos2107/wanderwise",
    "imgs": [
      [
        "/imgs/project-imgs/wanderwise-landing.png",
        "Landing Page of the Project"
      ],
      [
        "/imgs/project-imgs/wanderwise-flight-offer-search.png",
        "Feature where users can search for flights for their trips"
      ],
      [
        "/imgs/project-imgs/wanderwise-trip-details.png",
        "Feature where users can edit and view details of their upcoming trip."
      ]
    ]
  },
  {
    "title": "Order-Eatz",
    "description": "Order-Eatz is a mobile food ordering application where users can make food orders, save food orders, look through a menu of food options, and leave comments + reviews for food items.",
    "role": "Team Lead- Full Stack Software Engineer",
    "accomplishments": [
      "Managed and delivered a fully functioning project in 2 weeks by collaborating on the application architecture, delegating tasks, optimizing workflow, leading debugging efforts, and conducting code reviews with a small team, following Agile Scrum methodologies"
    ],
    "tech": ["React", "Node", "Express", "MongoDB", "Tailwind CSS"],
    "website": "https://order-eatz.netlify.app/",
    "github": "https://github.com/psantos2107/order-eatz-frontend",
    "imgs": [
      ["/imgs/project-imgs/order-eatz-home-page.png", "Home Page"],
      [
        "/imgs/project-imgs/order-eatz-order-page.png",
        "Order Page of the Mobile Food Ordering App"
      ],
      ["/imgs/project-imgs/order-eatz-menu-page.png", "Menu Page of Order-Eatz"]
    ]
  },
  {
    "title": "SweatShare",
    "description": "SweatShare is a fitness application where users can find exercise programs to try out and create exercise programs to share with other users.",
    "role": "Software Engineer",
    "tech": [
      "HTML",
      "CSS",
      "Vanilla JavaScript",
      "Node",
      "Embedded JavaScript",
      "Bootstrap",
      "Express",
      "MongoDB"
    ],
    "accomplishments": [
      "Leveraged Node's back-end capabilities and MongoDB's aggregation pipeline to enhance user experience with features like PDF printing, user reviews, user comments, exercise program aggregate ratings, and exercise program filtering",
      "Practiced MVC architecture principles to maintain a clear separation of concerns and ensure scalable code structure while implementing RESTful routing practices for maintainable API interactions"
    ],
    "website": "https://sweatshare-app-2f74e96226b5.herokuapp.com/",
    "github": "https://github.com/psantos2107/sweat-share",
    "imgs": [
      ["/imgs/project-imgs/sweatshare-landing.png", "Landing Page."],
      [
        "/imgs/project-imgs/sweatshare-index-page.png",
        "Page where users can view all available exercise programs."
      ],
      [
        "/imgs/project-imgs/sweatshare-exercise-program.png",
        "Page where users can view exercise programs"
      ]
    ]
  },
  {
    "title": "Pokemon Trivia Game",
    "description": "Pokemon Trivia game is a game where users can test their knowledge on everything Pokemon! Users will be tested across 5 different categories of questions in a 'Who Wants to Be a Millionaire' type of format.",
    "role": "Software Engineer",
    "accomplishments": [
      "Developed a dynamic Pokémon trivia game by implementing an Object-Oriented Programming approach with JavaScript classes and subclasses for dynamic question generation, integrating the PokéAPI for question content and Amazon S3 for static site hosting",
      "Created efficient algorithms to randomize question and answer content while ensuring no duplicate questions appear in game"
    ],
    "tech": ["HTML", "CSS", "Vanilla JavaScript"],
    "website": "http://pokemon-trivia-game2.s3-website-us-west-1.amazonaws.com/",
    "github": "https://github.com/psantos2107/pokemon-trivia-game",
    "imgs": [
      [
        "/imgs/project-imgs/prof-oak-game-screenshot.png",
        "Users get introduced to the game by Professor Oak."
      ],
      [
        "/imgs/project-imgs/pokemon-trivia-screenshot.png",
        "Example of the gameplay."
      ]
    ]
  }
]
